MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX550F256H.atdf
      <value-group caption="CRC Bit Order Selection bit" name="DCRCCON__BITO">
         <value caption="(When CRCTYP is 1) The IP header checksum is calculated Least Significant bit (LSb) first (i.e. reflected) / (When CRCTYP is 0) The LFSR CRC is calculated Least Significant bit first (i.e. reflected)" name="" value="0x1" />
         <value caption="(When CRCTYP is 1) The IP header checksum is calculated Most Significant bit (MSb) first (i.e. not reflected) / (When CRCTYP is 0) The LFSR CRC is calculated Most Significant bit first (i.e. not reflected)" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Write Byte Order Selection bit" name="DCRCCON__WBO">
         <value caption="Source data is written to the destination re-ordered as defined by BYTO" name="" value="0x1" />
         <value caption="Source data is written to the destination unaltered" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Byte Order Selection bits" name="DCRCCON__BYTO">
         <value caption="Endian byte swap on half-word boundaries (i.e. source half-word order with reverse source byte order per half-word)" name="" value="0x3" />
         <value caption="Swap half-words on word boundaries (i.e. reverse source half-word order with source byte order per half-word)" name="" value="0x2" />
         <value caption="Endian byte swap on word boundaries (i.e. reverse source byte order)" name="" value="0x1" />
         <value caption="No swapping (i.e. source byte order)" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC XOR Register bits" name="DCRCXOR__DCRCXOR">
         <value caption="(When DCRCCON = 0) Enable the XOR input to the Shift register / (When DCRCCON = 1) This register is unused." name="" value="0x1" />
         <value caption="(When DCRCCON = 0) Disable the XOR input to the Shift register; data is shifted in directly from the previous stage in the register / (When DCRCCON = 1) This register is unused." name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH0CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3"/>
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2"/>
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1"/>
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0"/>
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH0CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH0CON__CHAEN">
         <value caption="Channel is continuously enabled and not automatically disabled after a block transfer is complete" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH0CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH0CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH0CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH0CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH0CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH1CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3"/>
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2"/>
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1"/>
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0"/>
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH1CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH1CON__CHAEN">
         <value caption="Channel is continuously enabled and not automatically disabled after a block transfer is complete" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH1CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH1CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH1CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH1CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
